juliusz-b/zpssc-fw/Core/Inc/stm32g4xx_hal_conf.h
/**
 * stm32g4xx_hal_conf.h - konfiguracja HAL dla zpssc-fw
 * Juliusz Bojarczuk, Politechnika Warszawska
 *
 * Wlaczone tylko moduly uzywane przez firmware. Pozostale pliki HAL
 * kompiluja sie do pustych jednostek (straznik MODULE_ENABLED).
 */
#ifndef STM32G4xx_HAL_CONF_H
#define STM32G4xx_HAL_CONF_H

#ifdef __cplusplus
extern "C" {
#endif

/* ======================= Wlaczone moduly HAL ===================== */
#define HAL_MODULE_ENABLED
#define HAL_ADC_MODULE_ENABLED
#define HAL_DAC_MODULE_ENABLED
#define HAL_FMAC_MODULE_ENABLED
#define HAL_SPI_MODULE_ENABLED
#define HAL_TIM_MODULE_ENABLED
#define HAL_UART_MODULE_ENABLED
#define HAL_CORTEX_MODULE_ENABLED
#define HAL_DMA_MODULE_ENABLED
#define HAL_EXTI_MODULE_ENABLED
#define HAL_FLASH_MODULE_ENABLED
#define HAL_GPIO_MODULE_ENABLED
#define HAL_PWR_MODULE_ENABLED
#define HAL_RCC_MODULE_ENABLED

/* ======================= Oscylatory i zegary ===================== */
#if !defined  (HSE_VALUE)
#define HSE_VALUE     24000000U  /* niewykorzystany (brak kwarcu na Nucleo) */
#endif
#if !defined  (HSE_STARTUP_TIMEOUT)
#define HSE_STARTUP_TIMEOUT    100U
#endif
#if !defined  (HSI_VALUE)
#define HSI_VALUE     16000000U  /* HSI16 - zrodlo PLL */
#endif
#if !defined  (HSI48_VALUE)
#define HSI48_VALUE   48000000U
#endif
#if !defined  (LSI_VALUE)
#define LSI_VALUE     32000U
#endif
#if !defined  (LSE_VALUE)
#define LSE_VALUE     32768U
#endif
#if !defined  (LSE_STARTUP_TIMEOUT)
#define LSE_STARTUP_TIMEOUT    5000U
#endif
#if !defined  (EXTERNAL_CLOCK_VALUE)
#define EXTERNAL_CLOCK_VALUE   12288000U
#endif

/* ============================ Parametry HAL ====================== */
#define VDD_VALUE                     3300U
#define TICK_INT_PRIORITY             0U
#define USE_RTOS                      0U
#define PREFETCH_ENABLE               1U
#define INSTRUCTION_CACHE_ENABLE      1U
#define DATA_CACHE_ENABLE             1U

#define USE_HAL_ADC_REGISTER_CALLBACKS    0U
#define USE_HAL_DAC_REGISTER_CALLBACKS    0U
#define USE_HAL_FMAC_REGISTER_CALLBACKS   0U
#define USE_HAL_SPI_REGISTER_CALLBACKS    0U
#define USE_HAL_TIM_REGISTER_CALLBACKS    0U
#define USE_HAL_UART_REGISTER_CALLBACKS   0U

#define USE_SPI_CRC                   0U

/* ============================== Assert ========================== */
/* #define USE_FULL_ASSERT    1U */

/* ====================== Naglowki wlaczonych modulow =============== */
#ifdef HAL_RCC_MODULE_ENABLED
#include "stm32g4xx_hal_rcc.h"
#endif
#ifdef HAL_GPIO_MODULE_ENABLED
#include "stm32g4xx_hal_gpio.h"
#endif
#ifdef HAL_DMA_MODULE_ENABLED
#include "stm32g4xx_hal_dma.h"
#endif
#ifdef HAL_CORTEX_MODULE_ENABLED
#include "stm32g4xx_hal_cortex.h"
#endif
#ifdef HAL_ADC_MODULE_ENABLED
#include "stm32g4xx_hal_adc.h"
#endif
#ifdef HAL_DAC_MODULE_ENABLED
#include "stm32g4xx_hal_dac.h"
#endif
#ifdef HAL_EXTI_MODULE_ENABLED
#include "stm32g4xx_hal_exti.h"
#endif
#ifdef HAL_FLASH_MODULE_ENABLED
#include "stm32g4xx_hal_flash.h"
#endif
#ifdef HAL_FMAC_MODULE_ENABLED
#include "stm32g4xx_hal_fmac.h"
#endif
#ifdef HAL_PWR_MODULE_ENABLED
#include "stm32g4xx_hal_pwr.h"
#endif
#ifdef HAL_SPI_MODULE_ENABLED
#include "stm32g4xx_hal_spi.h"
#endif
#ifdef HAL_TIM_MODULE_ENABLED
#include "stm32g4xx_hal_tim.h"
#endif
#ifdef HAL_UART_MODULE_ENABLED
#include "stm32g4xx_hal_uart.h"
#endif

/* ============================ assert_param ====================== */
#ifdef  USE_FULL_ASSERT
#define assert_param(expr) ((expr) ? (void)0U : assert_failed((uint8_t *)__FILE__, __LINE__))
void assert_failed(uint8_t *file, uint32_t line);
#else
#define assert_param(expr) ((void)0U)
#endif

#ifdef __cplusplus
}
#endif

#endif /* STM32G4xx_HAL_CONF_H */
